import React from "react";

const ProductDesc = () => {
  return (
    <div className=" px-20 mt-6">
      <h6 className=" font-yekanExtraBold text-xl">توضیحات</h6>
      <p className=" font-yekanReg leading-8 mt-7">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
        صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با
        تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از
        طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
        صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه
        و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید
        سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و
        متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است .
      </p>
    </div>
  );
};

export default ProductDesc;
