import React from "react";

const ContactMethod = () => {
  return (
    <div className="w-[40%]">
      <div className="flex items-center gap-3">
        <svg
          width="41"
          height="41"
          viewBox="0 0 41 41"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M26.2658 0.97876C28.7008 0.97876 30.6746 4.67863 30.6746 7.81348C30.6746 10.9483 28.7008 13.489 26.2658 13.489C23.8307 13.489 21.8569 10.9479 21.8569 7.81348C21.8569 4.6791 23.8307 0.97876 26.2658 0.97876Z"
            fill="#FFAA00"
          ></path>
          <path
            d="M13.7387 0.97876C16.1737 0.97876 18.1475 4.67863 18.1475 7.81348C18.1475 10.9483 16.1737 13.489 13.7387 13.489C11.3036 13.489 9.32983 10.9479 9.32983 7.81348C9.32983 4.6791 11.3036 0.97876 13.7387 0.97876Z"
            fill="#FFAA00"
          ></path>
          <path
            d="M0.534818 17.5109C-0.500563 14.9255 -0.0464077 11.2055 2.01777 10.3819C4.08194 9.55835 6.97583 11.9425 8.01027 14.5283C9.04471 17.1142 8.20934 19.8781 6.1447 20.7017C4.08005 21.5252 1.56879 20.0967 0.534818 17.5109Z"
            fill="#FFAA00"
          ></path>
          <path
            d="M39.4698 17.5109C38.4344 20.0963 35.9241 21.5253 33.8599 20.7017C31.7957 19.8782 30.9604 17.1142 31.9943 14.5284C33.0283 11.9426 35.9227 9.55745 37.9868 10.3819C40.051 11.2064 40.5037 14.9251 39.4698 17.5109Z"
            fill="#FFAA00"
          ></path>
          <path
            d="M35.776 31.7942C35.3054 29.679 34.1759 27.7667 32.9292 25.9965C30.0075 21.85 25.329 17.6627 20.0025 17.6627C14.698 17.6627 9.99787 21.8491 7.07574 25.9965C5.82905 27.7667 4.7019 29.6766 4.22892 31.7942C3.75593 33.9119 4.01478 36.2805 5.3283 37.9991C6.64182 39.7176 9.13097 40.5816 11.0756 39.649C12.2324 39.0953 13.169 37.9789 14.4448 37.8712C15.6167 37.773 16.6521 38.5608 17.6291 39.2198C18.335 39.696 19.1869 40.1294 20.0025 40.135C20.8181 40.1294 21.6694 39.696 22.3758 39.2198C23.3529 38.5617 24.3882 37.773 25.5601 37.8712C26.836 37.9789 27.7721 39.0934 28.9293 39.649C30.874 40.5816 33.3631 39.7214 34.6766 38.001C35.9902 36.2805 36.249 33.9123 35.776 31.7942ZM24.6424 29.2432C24.0414 30.3403 23.0931 31.3063 22.2921 32.0579C21.8629 32.4609 21.4108 32.8388 20.9381 33.1899H20.9353C20.6648 33.3882 20.338 33.4951 20.0025 33.4951C19.6669 33.4951 19.3402 33.3882 19.0697 33.1899H19.0669C18.5941 32.8388 18.142 32.4609 17.7129 32.0579C16.9128 31.3058 15.9635 30.3403 15.3626 29.2432C14.866 28.3374 14.6067 27.3423 14.8637 26.3053C15.1103 25.3116 15.8953 24.4387 16.8582 24.3169C17.9717 24.1759 19.2683 24.9586 20.0025 25.8573C20.7366 24.9586 22.0332 24.1764 23.1467 24.3174C24.1096 24.4392 24.8946 25.3121 25.1413 26.3058C25.3982 27.3423 25.1389 28.3374 24.6424 29.2432Z"
            fill="#FFAA00"
          ></path>
        </svg>
        <p className="text-[37px] font-yekanExtraBold">راه های ارتباطی</p>
      </div>
      <p className="my-6 font-yekanReg leading-8">
        پت هوم، سرزمین حیوانات خانگی با محصولات باکیفیت برای پت های شما
      </p>
      <div className="flex items-center gap-2 my-6">
        <svg
          width="22"
          height="26"
          viewBox="0 0 22 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M14.3334 11.0006C14.3334 9.15894 12.8411 7.66663 11.0008 7.66663C9.15906 7.66663 7.66675 9.15894 7.66675 11.0006C7.66675 12.841 9.15906 14.3333 11.0008 14.3333C12.8411 14.3333 14.3334 12.841 14.3334 11.0006Z"
            stroke="#FFB500"
            stroke-width="1.5"
            stroke-linecap="round"
            stroke-linejoin="round"
          ></path>
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M10.9993 25C9.40138 25 1 18.1978 1 11.0844C1 5.51552 5.47613 1 10.9993 1C16.5226 1 21 5.51552 21 11.0844C21 18.1978 12.5973 25 10.9993 25Z"
            stroke="#FFB500"
            stroke-width="1.5"
            stroke-linecap="round"
            stroke-linejoin="round"
          ></path>
        </svg>
        <p className="font-yekanReg">
          آدرس : تهران، زعفرانیه، خیابان مقدس اردبیلی، راست چین
        </p>
      </div>
      <div className="flex items-center justify-between mt-6">
        <div className="flex items-center gap-2">
          <svg
            width="22"
            height="21"
            viewBox="0 0 22 21"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M13.353 1C17.054 1.411 19.978 4.331 20.393 8.032"
              stroke="#FFB500"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            ></path>
            <path
              d="M13.353 4.54297C15.124 4.88697 16.508 6.27197 16.853 8.04297"
              stroke="#FFB500"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            ></path>
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M10.0315 10.9724C14.0205 14.9604 14.9254 10.3467 17.4653 12.8848C19.9138 15.3328 21.3222 15.8232 18.2188 18.9247C17.8302 19.237 15.3613 22.9943 6.68447 14.3197C-1.99341 5.644 1.76157 3.17244 2.07394 2.78395C5.18377 -0.326154 5.66682 1.08938 8.11539 3.53733C10.6541 6.0765 6.04254 6.98441 10.0315 10.9724Z"
              stroke="#FFB500"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            ></path>
          </svg>
          <p>09123456789</p>
        </div>
        <div className="flex items-center gap-2">
          <svg
            width="22"
            height="20"
            viewBox="0 0 22 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16.9026 6.8512L12.4593 10.4642C11.6198 11.1302 10.4387 11.1302 9.59919 10.4642L5.11841 6.8512"
              stroke="#FFB500"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            ></path>
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M15.9089 19C18.9502 19.0084 21 16.5095 21 13.4384V6.57001C21 3.49883 18.9502 1 15.9089 1H6.09114C3.04979 1 1 3.49883 1 6.57001V13.4384C1 16.5095 3.04979 19.0084 6.09114 19H15.9089Z"
              stroke="#FFB500"
              stroke-width="1.5"
              stroke-linecap="round"
              stroke-linejoin="round"
            ></path>
          </svg>
          <p>info@pet-home.com</p>
        </div>
      </div>
    </div>
  );
};

export default ContactMethod;
